terraform plan:
```
aws_vpc.dev_vpc: Refreshing state... [id=vpc-0e434fc937ec7c46c]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d13bdb32f42b8240]
aws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-031948f8e811d6a18]
aws_spot_instance_request.dev[0]: Refreshing state... [id=sir-rw4pbx6g]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_spot_instance_request.dev[0] has been changed
  ~ resource "aws_spot_instance_request" "dev" {
      + block_duration_minutes          = 0
        id                              = "sir-rw4pbx6g"
      + instance_interruption_behaviour = "terminate"
      + spot_bid_status                 = "price-too-low"
      ~ spot_price                      = "0.0050" -> "0.005000"
      + spot_request_state              = "open"
        tags                            = {
            "Name" = "dev"
        }
      + valid_from                      = "0001-01-01T00:00:00Z"
      + valid_until                     = "0001-01-01T00:00:00Z"
        # (15 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_spot_instance_request.dev[0] is tainted, so must be replaced
-/+ resource "aws_spot_instance_request" "dev" {
      + arn                                  = (known after apply)
      + availability_zone                    = (known after apply)
      - block_duration_minutes               = 0 -> null
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + host_id                              = (known after apply)
      ~ id                                   = "sir-rw4pbx6g" -> (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      ~ instance_interruption_behaviour      = "terminate" -> (known after apply)
      + instance_state                       = (known after apply)
      ~ instance_type                        = "t3.xlarge" -> "t3.large"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ spot_bid_status                      = "price-too-low" -> (known after apply)
      + spot_instance_id                     = (known after apply)
      ~ spot_price                           = "0.005000" -> (known after apply)
      ~ spot_request_state                   = "open" -> (known after apply)
        tags                                 = {
            "Name" = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ valid_from                           = "0001-01-01T00:00:00Z" -> (known after apply)
      ~ valid_until                          = "0001-01-01T00:00:00Z" -> (known after apply)
        # (12 unchanged attributes hidden)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # cloudflare_record.dev[0] will be created
  + resource "cloudflare_record" "dev" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev0"
      + proxiable       = (known after apply)
      + ttl             = 120
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ dev_ip = [
      - "35.171.9.29",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```